init.org
#+auto_tangle: t
#+PROPERTY: header-args :tangle "~/.emacs.d/init.el"

* Early init
:PROPERTIES:
:header-args:emacs-lisp: :tangle "~/.emacs.d/early-init.el"
:END:
** Lexical Binding
#+begin_src emacs-lisp
;;; -*- lexical-binding: t -*-
#+end_src
** Header warning for generated code
#+begin_src emacs-lisp
  ;; This code is generated from init.org.
  ;; Do not modify, modify the source instead

#+end_src
** Set up straight
*** Bootstrap Straight
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
   (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
     (url-retrieve-synchronously
     "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
     'silent 'inhibit-cookies)
   (goto-char (point-max))
   (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src
*** Disable standard packages completely
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src
* Startup
** Lexical Binding
#+begin_src emacs-lisp
;;; -*- lexical-binding: t -*-
#+end_src
** Header warning for generated code
#+begin_src emacs-lisp
  ;; This code is generated from init.org.
  ;; Do not modify, modify the source instead

#+end_src
** Environment detection (Work or home, OS)
#+begin_src emacs-lisp
  (setq home (and (string-match "^martin$" (user-login-name)) (string-equal (system-name) "merlin")))
  (setq work-linux-local (and (string-match "^MAL1$" (user-login-name)) (string-equal system-type "gnu/linux")))
  (setq work-linux-remote (and (string-match "^martin$" (user-login-name)) (string-equal system-type "gnu/linux") (string-equal (system-name) "LP15-MAL1-CEM")))
  (setq work-linux (or work-linux-local work-linux-remote))
  (setq work-win (and (string-match "^mal1$" (user-login-name)) (or (string-equal system-type "windows-nt") (string-equal system-type "cygwin"))))
  (setq work (or work-linux work-win))
  (setq work-vnc (and work-linux-local (string-equal (getenv "DISPLAY") ":1.0")))

  (if work
      (setq browse-url-firefox-program "/home/home_dev/MAL1/tools/firefox/firefox"))
#+end_src
** Adjust path if necessary
#+begin_src emacs-lisp
  (when work-linux-local
    (setenv "PATH" "/opt/rh/gcc-toolset-11/root/usr/bin/:$PATH" t))
#+end_src
** use-package
#+begin_src emacs-lisp
  (straight-use-package 'use-package)
#+end_src
** straight
#+begin_src emacs-lisp
  (use-package straight
  :custom
  (straight-use-package-by-default t)
  (straight-recipe-overrides '((nil . ((scad-mode :type git :flavor melpa :files ("scad-mode.el" "ob-scad.el") :host github :repo "openscad/emacs-scad-mode"))))))
#+end_src
** Customization
Since init.el will be generated from this file, we save customization in a dedicated file.

#+begin_src emacs-lisp
  (setq custom-file (concat user-emacs-directory "custom.el"))

  (when (file-exists-p custom-file)
    (load custom-file nil t))
#+end_src
** Desktop
#+begin_src emacs-lisp
  (use-package desktop
    :straight (:type built-in)
    :config (desktop-save-mode t))
#+end_src
** Global keybindings
#+begin_src emacs-lisp
  (global-set-key (kbd "<delete>") 'c-electric-delete-forward)
  (global-set-key (kbd "C-c C-g") 'goto-line)
  (global-set-key (kbd "C-x C-b") 'ibuffer)

  (global-unset-key (kbd "C-x C-c"))
  (global-set-key (kbd "C-x C-c C-x") 'save-buffers-kill-terminal)
  (global-unset-key (kbd "M-SPC"))     ;; Originally just-one-space
  (global-set-key (kbd "M-SPC") 'dabbrev-expand)
  (global-set-key (kbd "<f2>") 'customize-group)
  (global-unset-key (kbd "C-z"))       ;; Who needs suspend-frame?
#+end_src
** Start Server
#+begin_src emacs-lisp
  (server-start)
#+end_src
* Basics
** Utility functions
#+begin_src emacs-lisp
  (defun ma-make-display-buffer-matcher-function (major-modes)
    (lambda (buffer-name action)
      (with-current-buffer buffer-name (apply #'derived-mode-p major-modes))))
#+end_src
** Editing
*** Avy
#+begin_src emacs-lisp
  (use-package avy
    :bind ("C-M-j" . 'avy-goto-char-timer))
#+end_src
*** Expand Region
#+begin_src emacs-lisp
  (use-package expand-region
	       :bind ("M-o" . er/expand-region))
#+end_src
*** Flycheck
#+begin_src emacs-lisp
  (use-package flycheck)
  (global-flycheck-mode)
#+end_src

*** Guess-language
#+begin_src emacs-lisp
  (defun ma-after-language-guess (lang beginning end)
    "Perform multiple settings after the language of a buffer has been guessed:
  - Switch the input method depending on the guessed language.
     Argument LANG: Language code."
    (message (format "Switching input language to %s" lang))
    (if (string-equal lang "de")
        (progn
          (activate-input-method "german-postfix")
          (ispell-change-dictionary "german"))
      (deactivate-input-method)
      (ispell-change-dictionary "american")))

  (use-package guess-language
    :custom (guess-language-languages '(en de))
    :config
    (add-hook 'guess-language-after-detection-functions #'ma-after-language-guess))
#+end_src
*** Multiple cursors
#+begin_src emacs-lisp
  (use-package multiple-cursors
	       :bind (("C-c C-n" . mc/mark-next-like-this)
		      ("C-c C-p" . mc/mark-previous-like-this)
		      ("C-c C-a" . mc/mark-all-like-this-in-defun)
		      ("C-c C-|" . mc/edit-lines)))
#+end_src
*** Swiper
#+begin_src emacs-lisp
  (use-package swiper
    :bind ("C-s" . swiper-isearch))
#+end_src
*** Smartscan
#+begin_src emacs-lisp
  (use-package smartscan)
#+end_src
*** Browse kill ring
#+begin_src emacs-lisp
  (use-package browse-kill-ring)
#+end_src

*** Visual Regexp
#+begin_src emacs-lisp
  (use-package visual-regexp
    :custom
    (vr/command-python (concat "python3 " user-emacs-directory "straight/build/visual-regexp-steroids/regexp.py"))
    :bind ("M-%" . 'vr/query-replace)
          ("C-M-%" . 'vr/replace))
#+end_src
*** Visual Regexp Steroids
#+begin_src emacs-lisp
  (use-package visual-regexp-steroids)
#+end_src
*** Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :diminish yas-minor-mode
    :hook
    (prog-mode . yas-minor-mode)
    (org-mode . yas-minor-mode))
  (use-package yasnippet-snippets)
#+end_src
*** Miscellaneous
#+begin_src emacs-lisp
  (add-hook 'before-save-hook
            'delete-trailing-whitespace)
#+end_src
** Version control
*** Magit
#+begin_src emacs-lisp
  (defface ma-magit-highlight-remote-face
    '((t :inherit magit-branch-remote
         :underline t))
    "Face for highlighting remote branches with specific text in them."
    :group 'ma)

  (use-package magit
    :bind ("C-c C-z" . magit-status)
    :config
    (add-hook 'magit-refs-mode-hook
              (lambda ()
                (add-to-list 'magit-ref-namespaces '("\\`refs/remotes/origin/\\(SPCK-[0-9]+-MAL1-.*\\)" . ma-magit-highlight-remote-face)))))
#+end_src
*** git-timemachine
#+begin_src emacs-lisp
  (use-package git-timemachine)
#+end_src
*** git-gutter
#+begin_src emacs-lisp
  (use-package git-gutter
    :diminish git-gutter-mode
    :config
    (add-hook 'text-mode-hook
              (lambda ()
                (unless (and (buffer-file-name) (file-remote-p (buffer-file-name)))
                  (git-gutter-mode)))))
#+end_src
** Remote work
#+begin_src emacs-lisp
  (setq ma-linux-desktop-machine "dell1254cem")
  (if work-linux-remote
      (progn
        (setq work-remote-machine ma-linux-desktop-machine)
        (setq work-remote-url (concat "/ssh:MAL1@" ma-linux-desktop-machine ":"))
        (setq enable-remote-dir-locals nil)
        (setq remote-file-name-inhibit-locks t)
        ;; Avoid version-control checks for tramp buffers
        (setq vc-ignore-dir-regexp
              (format "\\(%s\\)\\|\\(%s\\)"
                      vc-ignore-dir-regexp
                      tramp-file-name-regexp))

        (defun ma-ensure-ssh-running()
          (interactive)
          (let ((pname "remote-ssh"))
            (unless (get-process pname)
              (make-process :name pname
                            :command `("ssh" "-N" ,ma-linux-desktop-machine "-l" "mal1")
                            :buffer (get-buffer-create "remote-ssh"))))))
    (setq work-remote-url "")
    (setq work-remote-machine nil))
#+end_src
** Password cache
#+begin_src emacs-lisp
  (use-package password-cache
    :straight (:type built-in)
    :custom (password-cache-expiry 36000)
    :after flyspell
    )
#+end_src
** Navigation
*** Link-Hint
#+begin_src emacs-lisp
  (defun ma-spck-next-link (end)
    "Return position of next SPCK-{ID} link or nil if there is none."
    (save-excursion
      (when (looking-at "\\(SPCK-[0-9.]+\\)")
        (progn
          (skip-chars-forward "SPCK-")
          (skip-chars-forward "[:digit:]")))
      (when (re-search-forward "\\(SPCK-[[:digit:]]+\\)" end t)
        (progn
          (skip-chars-backward "[SPCK\\-][:digit:]")
          (point)))))


  (defun ma-spck-link-at-point-p ()
    "Return SPCK-{ID} link at point or nil if there is none."
    (save-excursion
      (skip-chars-backward "[SPCK\\-][:digit:]")
      (and
       (looking-at "\\(SPCK-[0-9.]+\\)")
       (concat "https://spck-jira.ux.dsone.3ds.com:8443/browse/" (match-string 1)))))

    (use-package link-hint
      :config
      (link-hint-define-type 'spck-url
                             :next 'ma-spck-next-link
                             :at-point-p 'ma-spck-link-at-point-p
                             :open #'browse-url)
      (push 'link-hint-spck-url link-hint-types)
      :bind ("C-c o" . 'link-hint-open-link))

#+end_src
