init.el
  (progn (setq projectile-project-search-path '("/scratch/apel"))
         (setq projectile-git-command (concat (getenv "HOME") "/bin/projectile_ls.sh"))))
 (work-linux-remote
  (progn (setq projectile-project-search-path '("/scratch/apel"))
         (setq projectile-git-command (concat (getenv "HOME") "/bin/projectile_ls.sh"))
         (setq projectile-enable-caching t)))
 (work-win (setq projectile-project-search-path '("D:/users/apel")))
 (home (setq projectile-project-search-path '("/home/martin"))))

(defun ma-projectile-mode-line()
  "Generates a projectile mode line"
  (format " Proj[%s]" (projectile-project-name)))

(use-package projectile
  :init
  (projectile-mode 1)
  ;; This is needed to avoid slowdown when working with remote files.
  (defadvice projectile-project-root (around ignore-remote first activate)
    (unless (file-remote-p default-directory) ad-do-it))

  :bind
  ("C-c C-f" . projectile-find-file)
  :bind-keymap
  ("C-S-p" . projectile-command-map)
  :custom
  (projectile-sort-order 'recently-active)
  (projectile-git-submodule-command nil)
  (projectile-mode-line-prefix "")
  (projectile-mode-line-function 'ma-projectile-mode-line))

(defun ma-deadgrep-root-function()
  "Determine root directory for current buffer."
    (if (and (buffer-file-name) (file-in-directory-p (buffer-file-name) "/scratch/apel/new_arch/develop/src/ooa"))
        "/scratch/apel/new_arch/develop/src/ooa"
      (if (and (buffer-file-name) (file-in-directory-p (buffer-file-name) "/scratch/apel/new_arch/develop/src"))
          "/scratch/apel/new_arch/develop/src"
        (deadgrep--project-root))))
(use-package deadgrep
  :bind ("C-c C-r" . deadgrep)
  :custom (deadgrep-max-buffers  1)
  (deadgrep-project-root-function 'ma-deadgrep-root-function))

(use-package hydra
  :straight (:host github :repo "abo-abo/hydra"))

(use-package all-the-icons)

(use-package diminish)

(use-package uniquify
  :straight (:type built-in)
  :custom (uniquify-buffer-name-style 'post-forward-angle-brackets))

(use-package ace-window
  :bind ("C-x o" . 'ace-window)
  :custom (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

(use-package which-key
  :diminish which-key-mode
  :config (which-key-mode)
  :custom (which-key-max-description-length 35))

(use-package doom-modeline
  :custom
  (doom-modeline-modal-icon nil)
  (doom-modeline-persp-icon nil)
  (doom-modeline-persp-name nil)
  (doom-modeline-buffer-file-name-style 'buffer-name)
  (doom-modeline-vcs-max-length 25)
  :config
  (progn
    (doom-modeline-mode 1)
    (if home
        (display-battery-mode t))))

(use-package modus-themes
  :custom
    (modus-themes-deuteranopia t)
    (modus-themes-bold-constructs t)
    (modus-themes-italic-constructs t)
    (modus-themes-paren-match '(bold))
    (modus-themes-mode-line '(3d))
    (modus-themes-hl-line '(intense))
    (modus-themes-headings '((t variable-pitch)))
  :config
  (progn
    (load-theme 'modus-vivendi :no-confirm)))

(use-package unicode-fonts
  :config (unicode-fonts-setup))

(global-font-lock-mode 1)

(use-package fontaine
  :custom (fontaine-presets
           '((home
              :default-family "DejaVu Sans Mono"
              :default-height 80
              :fixed-pitch-family "DejaVu Sans Mono"
              :fixed-pitch-height 100
              :variable-pitch-family "Nimbus Roman"
              :variable-pitch-height 100)
             (work
              :inherit home)
             (screen-sharing
              :inherit home
              :default-height 100
              :fixed-pitch-family "DejaVu Sans Mono"
              :fixed-pitch-height 120
              :variable-pitch-family "Nimbus Roman"
              :variable-pitch-height 120))))
(if (or home work-linux-remote)
    (fontaine-set-preset 'home)
  (fontaine-set-preset 'work))

(use-package whitespace
  :straight (:type built-in)
  :custom (whitespace-line-column 150)
  (whitespace-style '(face lines-tail))
  :hook (prog-mode . whitespace-mode))

(defalias 'yes-or-no-p 'y-or-n-p)
(setq frame-inhibit-implied-resize t)

(defun ma-devdocs-lookup-at-point()
  (interactive)
  (devdocs-lookup nil (thing-at-point 'symbol)))

(use-package devdocs
  :bind
  ("C-c C-S-d" . 'ma-devdocs-lookup-at-point)
  ("C-c C-d" . devdocs-lookup)
  :init
  (add-hook 'c-mode-common-hook
            (lambda()
              (setq-local devdocs-current-docs '("cpp" "qt~5.12"))
              (local-unset-key (kbd "C-c C-d"))))
  (add-hook 'cmake-mode-hook
            (lambda()
              (setq-local devdocs-current-docs '("cmake~3.23"))
              (local-unset-key (kbd "C-c C-d"))))
  (add-hook 'dockerfile-mode-hook
            (lambda()
              (setq-local devdocs-current-docs '("docker"))))
  (add-hook 'js-mode-hook
            (lambda()
              (setq-local devdocs-current-docs '("node~18_lts" "javascript"))))
  (add-hook 'python-mode-hook
            (lambda()
              (setq-local devdocs-current-docs '("python~3.10"))))
  (add-hook 'perl-mode-hook
            (lambda()
              (setq-local devdocs-current-docs '("perl~5.34"))))
  (add-hook 'yaml-mode-hook
            (lambda()
              (setq-local devdocs-current-docs '("ansible")))))

(setq Info-directory-list '("/usr/local/share/info/" "/usr/share/info/"))

(use-package helpful
:bind
("C-h f" . helpful-callable)
("C-h v" . helpful-variable)
("C-h k" . helpful-key)
("C-c C-d" . helpful-at-point))
(add-to-list 'display-buffer-alist
             `(,(ma-make-display-buffer-matcher-function '(helpful-mode))
               (display-buffer-reuse-window display-buffer-in-direction)
               (direction . bottom)
               (window-height . 0.5)))

(defun ma-cmake-upcase-completion-list (candidates)
  "Converts all incoming completion candidates to upper case"
  (if (string-equal major-mode "cmake-mode")
 (mapcar 'upcase candidates)
    candidates))

(use-package company
 :diminish company-mode
 :config
 (global-company-mode)
 :custom
   (company-dabbrev-downcase nil)
   (company-transformers '(ma-cmake-upcase-completion-list company-sort-by-occurrence))
   (company-cmake-executable "/scratch/apel/new_arch/develop/extern/linux64/cmake-3.23/bin/cmake")
   (company-backends '(company-cmake company-capf company-files
                                     (company-dabbrev-code company-keywords)
                                     company-dabbrev))
   (company-idle-delay 2.0)
   :bind ("C-M-S-s-c" . company-complete))

;; (use-package company-box
;;   :after company
;;   :diminish company-box-mode
;;   :hook company-mode)

(use-package vertico
  :custom
    (vertico-sort-function #'vertico-sort-history-alpha)
  :config
  (progn
    (vertico-mode)
    (define-key vertico-map (kbd "TAB") 'minibuffer-complete)
    (savehist-mode)))

(use-package orderless
  :custom (completion-styles '(substring orderless basic)))

(use-package marginalia
  :init
  (marginalia-mode))

(when work-linux-remote
  (defun ma-switch-to-mu4e ()
