init.el
    "Switch to unread mail in mu4e"
    (interactive)
    (unless (mu4e-running-p)
      (mu4e t))
    (mu4e-search-bookmark (mu4e-get-bookmark-query ?i))
    (mu4e-headers-change-sorting :date 'ascending))

  (defun ma-view-previous-next-advice(orig &rest args)
    (let ((switch-to-buffer-obey-display-actions nil))
      (apply orig args)))

  (use-package mu4e
    :straight (:branch "release/1.10")
    :load-path "straight/repos/mu/build/mu4e"
    :commands mu4e-running-p mu4e
    :custom
    (mu4e-mu-binary (concat user-emacs-directory "straight/repos/mu/build/mu/mu"))
    (mu4e-bookmarks
     (quote
      (("(maildir:/INBOX OR maildir:/AutoNotifications) AND NOT flag:trashed" "INBOX" 105)
       ("flag:unread AND NOT flag:trashed AND NOT maildir:Trash" "Unread messages" 117)
       ("date:today..now AND NOT flag:trashed AND NOT maildir:Trash AND NOT maildir:/Junk" "Today's messages" 116)
       ("date:7d..now AND NOT flag:trashed AND NOT maildir:Trash AND NOT maildir:/Junk" "Last 7 days" 119))))
    (mu4e-headers-fields
     '( (:human-date . 12)
        (:flags . 6)
        (:from-or-to . 30)
        (:subject)))
    (mu4e-compose-signature-auto-include nil)
    (mu4e-compose-dont-reply-to-self t)
    (mu4e-compose-complete-only-after "2020-01-01")
    (mu4e-drafts-folder "/Drafts")
    (mu4e-get-mail-command "~/bin/Linux/call_mbsync.sh")
    (mu4e-completing-read-function 'completing-read)
    (mu4e-headers-include-related nil)
    (mu4e-index-update-error-warning nil)
    (mu4e-hide-index-messages t)
    (mu4e-sent-folder "/Sent")
    (mu4e-trash-folder "/Trash")
    (mu4e-update-interval 120)
    (mu4e-use-fancy-chars t)
    (mu4e-attachment-dir "/tmp")
    (mu4e-change-filenames-when-moving t)
    (mu4e-headers-visible-lines 20)
    (mu4e-org-link-query-in-headers-mode t)
    (mu4e-modeline-support nil)
    (message-send-mail-function (quote smtpmail-send-it))

    (smtpmail-debug-info nil)
    (smtpmail-local-domain "3ds.com")
    (smtpmail-smtp-server "smtps.emea.3ds.com")
    (smtpmail-smtp-service 587)
    (smtpmail-stream-type (quote starttls))

    (mail-user-agent 'mu4e-user-agent)
    (shr-color-visible-luminance-min 80)
    :config
    (set-variable 'read-mail-command 'mu4e)
    (advice-add 'mu4e-view-headers-next :around #'ma-view-previous-next-advice)
    (advice-add 'mu4e-view-headers-prev :around #'ma-view-previous-next-advice)
    (advice-add 'mu4e-headers-mark-and-next :around #'ma-view-previous-next-advice)

    (add-to-list 'display-buffer-alist
                 `("^\\*mu4e-headers\\*$"
                   (display-buffer-reuse-window)
                   (window-min-height . 0.25)))

    (add-to-list 'display-buffer-alist
                 `("^\\*mu4e"
                   (display-buffer-reuse-window)))

    (add-to-list 'display-buffer-alist
                 `("^\\*Article\\*"
                   (display-buffer-reuse-window)))

    :bind ("<f4>" . ma-switch-to-mu4e)))

(use-package mu4e-alert
  :after (mu4e)
  :custom
  (mu4e-alert-email-notification-types '(count))
  (mu4e-alert-style 'notifications)
  (mu4e-alert-interesting-mail-query "maildir:/INBOX AND NOT flag:trashed AND flag:unread")
  :init
  (mu4e-alert-enable-notifications)
  :config
  (mu4e-alert-enable-mode-line-display))

(defun ma-define-snippets-for-mail ()
  "Define snippets to be used in org-msg-edit-mode."

  (yas-define-snippets 'org-msg-edit-mode
                       '(("ger"
                          "\nHi `(org-msg-get-to-name)`,\n\n$0\n\n#+begin_signature\n--\nViele Grüße,\n\nMartin\n#+end_signature\n"
                          "MailDeutsch")
                         ("eng"
                          "\nHi `(org-msg-get-to-name)`,\n\n$0\n\n#+begin_signature\n--\nBest Regards,\n\nMartin\n#+end_signature\n"
                          "MailEnglisch"))))

(defun ma-make-display-buffer-matcher-function-org-msg()
  (lambda (buffer-name action)
    (with-current-buffer buffer-name (derived-mode-p org-msg-mode))))

(use-package org-msg
  :after (mu4e)
  :custom
  (org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t")
  (org-msg-startup "hidestars indent inlineimages")
  (org-msg-greeting-fmt nil)
  (org-msg-recipient-names '(("martin.apel@3ds.com" . "Martin")
                             ("Magdalena.NIEDHAMMER@3ds.com" . "Lena")
                             ("Rajanagaprasad.KODALI@3ds.com" . "Prasad")
                             ("David.BLUMENTHAL@3ds.com" . "Dave")
                             ("Edward.WATRAS@3ds.com" . "Ed")))
  (org-msg-greeting-name-limit 3)
  (org-msg-default-alternatives '((new		. (html))
                                  (reply-to-html	. (html))
                                  (reply-to-text	. (html))))
  (org-msg-convert-citation t)
  (org-msg-signature nil)

  :config
  (add-to-list 'display-buffer-alist
               `(,(ma-make-display-buffer-matcher-function '(org-mode))
                 (display-buffer-reuse-window)))
  (ma-define-snippets-for-mail))

(defun ma-org-msg-get-to-name-advice(orig &rest args)
  "Return first name of addressee or defer to org-msg-get-to-name."
  (save-excursion
    (let ((to (org-msg-message-fetch-field "to")))
      (if (string-match "^\\([[:upper:]]+\\) \\([[:alpha:]]+\\) <\\([[:alpha:]]+\.[[:alpha:]]+@3ds\.com\\)>$" to)
          (let ((mail-addr (match-string 3 to)))
            (or (assoc-default mail-addr org-msg-recipient-names)
                (match-string 2 to)))
        (apply orig args)))))

(advice-add 'org-msg-get-to-name :around #'ma-org-msg-get-to-name-advice)

(org-msg-mode)

(add-hook 'org-msg-edit-mode-hook
          (lambda ()
            (define-key org-msg-edit-mode-map (kbd "C-c C-f C-s") 'message-goto-subject)
            (define-key org-msg-edit-mode-map (kbd "C-c C-f C-t") 'message-goto-to)
            (define-key org-msg-edit-mode-map (kbd "C-c C-f C-c") 'message-goto-cc)
            (define-key org-msg-edit-mode-map (kbd "C-c C-f C-b") 'message-goto-bcc)
            (flyspell-mode 1)
            (setq flyspell-generic-check-word-predicate 'mail-mode-flyspell-verify)
            (guess-language-mode 1)))
