init.el

(use-package german-holidays
  :custom calendar-holidays holiday-german-BY-holidays)

(setq diary-file "~/.emacs.d/diary")
(setq calendar-url "http://localhost:1080/users/Martin.APEL@3ds.com/calendar/")
(setq calendar-view-diary-initially-flag t)
(setq diary-number-of-entries 3)
(setq calendar-time-display-form '(24-hours ":" minutes))
(setq calendar-week-start-day 1)
(setq appt-display-diary t)
(setq appt-display-format 'window)
(setq org-agenda-include-diary t)

(add-hook 'diary-list-entries-hook #'diary-sort-entries t)

(defvar ma--getcal-last-update nil "Last time the calendar has been updated.")

(defun ma--getcal-do (url file)
  "Download ics file and add it to file"
  (let ((tmpfile (url-file-local-copy url)))
    (icalendar-import-file tmpfile file)
    (let ((tmp-buffer (find-buffer-visiting tmpfile)))
      (when tmp-buffer
        (kill-buffer tmp-buffer)))
    (delete-file tmpfile)))

(defun ma-getcal ()
  "Load an ICS calendar into the Emacs diary"
  (interactive)
  (message (concat "Loading " calendar-url " into " diary-file))
  (let ((diary-buffer (find-file-noselect diary-file)))
    (with-current-buffer diary-buffer
      (erase-buffer)
      (ma--getcal-do calendar-url diary-file)
      (save-buffer)))
  (setq ma--getcal-last-update (float-time)))

(defun ma--getcal-if-necessary ()
  "Reload the calendar if it hasn't been updated for an hour."
  (when (or (not (and (floatp ma--getcal-last-update) (< (- (float-time) ma--getcal-last-update) 3600))))
    (ma-getcal)))

(when work
  (appt-activate 1)
  (run-with-idle-timer 60 t 'ma--getcal-if-necessary))

(defun ma-show-agenda-if-hidden ()
  "Show Org agenda of today if it is currently hidden. Returns t, if it already was visible, otherwise nil"
  (interactive)
  (let* ((buf (get-buffer "*Org Agenda*")))
    (if (not buf)
        (progn
          (org-agenda-list 1)
          nil)
      (if (not (get-buffer-window buf))
          (progn
            (switch-to-buffer buf)
            nil)
        t)
      )
    )
  )

(use-package org
  :straight (:type built-in)
  :custom
  (org-agenda-files '("~/org" "~/org/jira" "~/org-roam"))
  (org-agenda-custom-commands
   (quote
    (("w" "Work agenda only" alltodo ""
      ((org-agenda-files (list ma-na-org))))
     ("h" "Home agenda only" agenda ""
      ((org-agenda-files (list ma-private-org))))
     ("s" "Unscheduled items" alltodo ""
      ((org-agenda-skip-function
        (quote
         (org-agenda-skip-entry-if
          (quote scheduled)
          (quote nottodo)
          (quote todo))))))
     )))
  (org-agenda-repeating-timestamp-show-all nil)
  (org-agenda-skip-deadline-prewarning-if-scheduled t)
  (org-agenda-skip-scheduled-if-deadline-is-shown t)
  (org-agenda-start-on-weekday nil)
  (org-babel-load-languages (quote ((emacs-lisp . t) (dot . t) (ditaa . t) (shell . t))))
  (org-export-backends (quote (ascii html icalendar latex md pandoc jira)))
  (org-capture-templates
   (quote
    (
     ("g" "General" entry
      (file+olp "~/org/na.org" "Unsorted")
      "** TODO %?")
     ("t" "Test" entry (file "~/org/test.org") nil)
     ("m" "TODO from Mail" entry
      (file+headline "~/org/na.org" "Mail")
      "** TODO [#A] %?Mail: %a\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n" :immediate-finish t :jump-to-captured t))))
  (sorg-scheduled-past-days 5)
  :bind
  ("C-c a" . 'org-agenda)
  ("C-c C" . 'org-capture)
  :hook (org . hl-line-mode)
  :config
  (define-key org-mode-map (kbd "C-c C-z") nil))      ;; Free up for global magit-status binding

(use-package ox-pandoc
  :straight t)

(use-package org-jira
  :if work
  :custom
  (jiralib-url "https://spck-jira.ux.dsone.3ds.com:8443")
  (org-jira-working-dir "~/org/jira")
  ;;                            other         dev 2023               dev 2023x    in progress       testing             ready
  (org-jira-default-jql "filter = 33100 OR filter = 62300 OR filter = 33400 OR filter = 10903 OR filter = 14101 ORDER BY status asc")
  (org-jira-use-status-as-todo t)
  :config
  (add-hook 'org-mode-hook
            (lambda()
              (if (and (buffer-file-name) (file-in-directory-p (buffer-file-name) "~/org/jira"))
                  (org-jira-mode 1)))))

(use-package ox-jira
  :if work)

(use-package org-bullets
  :hook (org-mode . org-bullets-mode))

(use-package emacsql
  :if work)
(use-package org-roam
  :if work
  :custom
  (org-roam-directory "~/org-roam")
  (org-roam-capture-templates
   '(("d" "default" plain "%?" :target
      (file+head "%<%Y-%m-%d_%H:%M:%S>-${slug}.org" "#+title: ${title}")
      :unnarrowed t)
     ("s" "spck" plain (file "~/org-roam/templates/spck-template.org")
      :target (file "%<%Y-%m-%d_%H:%M:%S>-SPCK-${slug}.org")
      :unnarrowed t)
     ))
  (org-roam-database-connector 'sqlite-builtin)
  :bind
  ("C-c n l" . 'org-roam-buffer-toggle)
  ("C-c n f" . 'org-roam-node-find)
  ("C-c n i" . 'org-roam-node-insert)
  :after emacsql
  :config
  (org-roam-db-autosync-mode))

(use-package org-auto-tangle
  :diminish org-auto-tangle-mode
  :hook (org-mode . org-auto-tangle-mode))

(when work-linux-local
