init.el
  (defun ma-bitlbee-identify ()
    "Auto-identify for Bitlbee channels using authinfo"
    (interactive)
    (when (string= (buffer-name) "&bitlbee")
      (let* ((entry (nth 0 (auth-source-search :max 1
                                               :host "dell1254cem"
                                               :user "MAL1"
                                               :port 6667)))
             (secret (plist-get entry :secret))
             (user (plist-get entry :user))
             (password (if (functionp secret)
                           (funcall secret)
                         secret)))
        (erc-message "PRIVMSG" (concat (erc-default-target) " account add sipe martin.apel@3ds.com,dsone\\\\" user " " password))
        (erc-message "PRIVMSG" (concat (erc-default-target) " account sipe set useragent \"UCCAPI/16.0.6001.1073 OC/16.0.6001.1073 (Skype for Business)\""))
        (erc-message "PRIVMSG" (concat (erc-default-target) " account sipe on"))
        (erc-log-mode 1)
        )
      ))

  (defun ma-bitlbee-ignore-unimportant (msg)
    "less noise from bitlbee"
    (if (string-match "localhost has changed mode for " msg)
        (setq erc-insert-this nil)))

  (defun ma-erc-format-nick (&optional user _channel-data)
    "Format the nick name."
    (when user
      (progn
        (message "User is %s" user)
        (message "Nickname is %s" (erc-server-user-nickname user))
        (erc-server-user-nickname user))))
  )

(use-package erc
  :if work-linux-local
;;  :custom
;;   (erc-autoaway-idle-seconds 1800)
;;   (erc-autoaway-message "Away")
;;   (erc-notifications-mode t)
;;   (erc-track-showcount t)
;;   (erc-hide-list '("JOIN" "PART" "QUIT" "MODE" "MODE-nick"))
;;   (erc-nick "martin")
;;   (erc-notifications-icon "/usr/share/icons/Adwaita/48x48/actions/call-start.png")
;;   (erc-server "dell1254cem")
;;   (erc-track-exclude-types '("JOIN" "NICK" "PART" "333" "353"))
;;   (erc-user-full-name "Martin Apel")
;;  :config
;;   (add-to-list 'erc-modules 'autoaway)
;;   (add-to-list 'erc-modules 'dcc)
;;   (add-to-list 'erc-modules 'notifications)
;;   (add-to-list 'erc-modules 'smiley)
;;   (add-to-list 'erc-modules 'spelling)
;;   (erc-update-modules)
  :requires 'auth-source)

(when work-linux-local
  (progn
    (add-hook 'erc-insert-pre-hook 'ma-bitlbee-ignore-unimportant)
    (add-hook 'erc-join-hook 'ma-bitlbee-identify)
    (erc :server "localhost" :nick "martin" :password "")))

(use-package subword
  :straight (:type built-in)
  :config
  (add-hook 'prog-mode-hook
            (lambda()
              (local-set-key (kbd "M-<left>") 'subword-backward)
              (local-set-key (kbd "M-<right>") 'subword-forward)
              (subword-mode t))))

(use-package idle-highlight-mode
  :hook prog-mode)

(add-hook 'prog-mode-hook 'hl-line-mode)

(add-hook 'prog-mode-hook
          (lambda()
            (lock-file-mode nil)
            (smartscan-mode 1)))

(use-package lsp-mode
  :custom
  (read-process-output-max (* 1024 1024)) ;; 1mb
  (gc-cons-threshold 100000000)

  (lsp-completion-provider :capf)
  (lsp-eldoc-enable-hover nil)
  (lsp-client-packages '(lsp-bash lsp-clangd lsp-clients lsp-cmake lsp-dockerfile lsp-groovy lsp-javascript lsp-json lsp-perl lsp-php lsp-pyls lsp-xml lsp-yaml))
  (lsp-clients-clangd-args '("--background-index" "--log=info" "-j=8" "--clang-tidy"))
  (lsp-completion-no-cache t)
  (lsp-enable-indentation nil)
  (lsp-enable-folding nil)
  (lsp-enable-on-type-formatting nil)
  (lsp-keymap-prefix "C-r")
  (lsp-modeline-code-actions-enable nil)
  (lsp-modeline-diagnostics-scope :file)
  (lsp-response-timeout 2)
  (lsp-restart 'auto-restart)
  :hook (prog-mode . #'lsp-deferred)
        (lsp-mode . lsp-enable-which-key-integration))

(use-package lsp-ui
  :after (lsp)
  :hook (c++-mode . yas-minor-mode)
        (c++ts-mode . yas-minor-mode))

(use-package modern-cpp-font-lock
  :config (modern-c++-font-lock-global-mode t))

(add-hook 'c-mode-common-hook 'smerge-start-session)

(add-hook 'c-mode-common-hook
           (lambda ()
             (local-set-key (kbd "C-c C-o") 'ff-find-other-file)
             (local-set-key (kbd "C-c C-s") 'hs-show-block)
             (local-set-key (kbd "C-M-a") 'beginning-of-defun)
             (local-set-key (kbd "C-M-e") 'end-of-defun)
             (local-set-key (kbd "<delete>") 'c-electric-delete-forward)
             (local-set-key (kbd "C-c =") 'align-regexp)
             (local-set-key (kbd "C-c *") 'ma-insert-separator)
             (local-unset-key (kbd "C-c C-a"))                       ;; Free keybinding for multiple-cursors
             (local-unset-key (kbd "C-c C-n"))
             (local-unset-key (kbd "C-c C-p"))
             (local-unset-key (kbd "C-c C-z"))))                     ;; Free keybinding for magit-status
;; (add-hook 'c-ts-base-mode-hook
;;            (lambda ()
;;              (local-set-key (kbd "C-c C-o") 'ff-find-other-file)
;;              (local-set-key (kbd "C-c C-s") 'hs-show-block)
;;              (local-set-key (kbd "C-M-a") 'beginning-of-defun)
;;              (local-set-key (kbd "C-M-e") 'end-of-defun)
;;              (local-set-key (kbd "<delete>") 'c-electric-delete-forward)
;;              (local-set-key (kbd "C-c =") 'align-regexp)
;;              (local-set-key (kbd "C-c *") 'ma-insert-separator)
;;              (local-unset-key (kbd "C-c C-a"))                       ;; Free keybinding for multiple-cursors
;;              (local-unset-key (kbd "C-c C-n"))
;;              (local-unset-key (kbd "C-c C-p"))
;;              (local-unset-key (kbd "C-c C-z"))))                     ;; Free keybinding for magit-status
