init.org
*** Treesitter for C++
#+begin_src emacs-lisp
  (defun ma-indent-style()
    "Override the built-in BSD indentation style with some additional rules"
    `(;; Here are your custom rules
  ;;     ((node-is ")") parent-bol 0)
  ;;     ((match nil "argument_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
  ;;     ((parent-is "argument_list") prev-sibling 0)
  ;;     ((match nil "parameter_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
  ;;     ((parent-is "parameter_list") prev-sibling 0)
      ((and (parent-is "if_statement") (not (node-is "compound_statement"))) parent-bol 3)

      ;; Append here the indent style you want as base
      ,@(alist-get 'bsd (c-ts-mode--indent-styles 'cpp))))

  (use-package c-ts-mode
    :if (treesit-language-available-p 'c)
    :disabled t
    :custom
    (c-ts-mode-indent-offset 3)
    (c-ts-mode-indent-style #'ma-indent-style)
    :init
    ;; Remap the standard C/C++ modes
    (add-to-list 'major-mode-remap-alist '(c-mode . c-ts-mode))
    (add-to-list 'major-mode-remap-alist '(c++-mode . c++-ts-mode))
    (add-to-list 'major-mode-remap-alist '(c-or-c++-mode . c-or-c++-ts-mode)))
#+end_src
*** Misc
#+begin_src emacs-lisp
  (add-hook 'c-mode-common-hook
            (lambda ()
              (imenu-add-to-menubar "Functions")
              (local-set-key (kbd "C-c C-i") 'imenu)
              (if work
                  (add-hook 'before-save-hook 'ma-create-or-update-copyright))
              (c-toggle-hungry-state 1)
              (cwarn-mode)
              (hs-minor-mode)
              (hs-hide-initial-comment-block)))
  (add-to-list 'auto-mode-alist '("\\.h" . c++-mode))
#+end_src
** CMake
#+begin_src emacs-lisp
  (use-package cmake-mode
    :custom (cmake-tab-width 3)
    :init
    (add-hook 'cmake-mode-hook
              (lambda ()
                (local-set-key (kbd "C-c C-d") 'cmake-help)
                (flyspell-prog-mode)
                (setq indent-line-function 'indent-relative))))
#+end_src

** Dockerfile
#+begin_src emacs-lisp
  (use-package dockerfile-mode)
#+end_src
** docker-compose-mode
#+begin_src emacs-lisp
  (use-package docker-compose-mode)
#+end_src
** Javascript
#+begin_src emacs-lisp
  (use-package js2-mode
  :mode ("\\.js$" "\\.sjs$" "\\.qs$")
  :custom
  (js2-include-node-externs t)
  (js2-mode-assume-strict t)
  (js2-include-browser-externs nil))
#+end_src
** Jenkinsfile
#+begin_src emacs-lisp
  (use-package jenkinsfile-mode)
#+end_src
** Elisp
*** Auto-compile
#+begin_src emacs-lisp
  (use-package auto-compile
    :custom (load-prefer-newer t)
    :config (auto-compile-on-load-mode 1)
    (auto-compile-on-save-mode 1))
#+end_src
*** Keybindings
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook
            (lambda ()
              (local-set-key (kbd "M-.") 'find-function-other-window)))
#+end_src

** Shell
#+begin_src emacs-lisp
  (add-hook 'shell-mode-hook
            'dirtrack-mode)
  (add-hook 'after-save-hook
            'executable-make-buffer-file-executable-if-script-p)
#+end_src
** REST API
#+begin_src emacs-lisp
(use-package restclient)
#+end_src
* Other specialized modes
** Generic
#+begin_src emacs-lisp
  (use-package generic
    :straight (:type built-in)
    :if work
    :config
    (define-generic-mode
        'spck-mode
      '("!")
      '("body"
        "constr"
        "control"
        "ens"
        "express"
        "force"
        "joint"
        "marker"
        "poly"
        "prim"
        "road"
        "refsys"
        "sensor"
        "slv"
        "substr"
        "subvar"
        "track"
        "timex"
        "view"
        "yout")
      '(
        ("\\(\\$[A-Za-z0-9_]+\\)" 1 font-lock-variable-name-face)
        ("\\([+-]?[0-9]\\.[0-9]+E[+-][0-9]+\\)" 1 font-lock-constant-face)
        ("'\\([^']+\\)'" 1 font-lock-string-face)
        )
      '("\\.sys$" "\\.ani$" "\\.spck$")
      (list
       (function
        (lambda ()
          (setq imenu-generic-expression
                '((nil "(.*\\(\\$[A-Za-z0-9_]+\\).*) *=" 1)))
          (imenu-add-menubar-index)
          (local-set-key [?\C-c ?\C-j] 'imenu))))
      "A mode for SIMPACK model files"))
#+end_src

** Skeleton
#+begin_src emacs-lisp
  (use-package skeleton
    :straight (:type built-in)
    :if work
    :config
    (define-skeleton header-skeleton
      "Define a C++ header file skeleton"
      ""
      "// Copyright Dassault Systemes Simulia Corp.\n\n"
      "#pragma once\n\n"
      "#include \"base/WinExportDefs.h\"\n\n"
      "namespace " (skeleton-read "Namespace name?") "\n"
      "{\n\n"
      "class SPCK_XXX_EXPORT " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "\n"
      "{\n"
      "public:\n\n"
      "   " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "(const " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "&) = delete;\n"
      "   " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "& operator=(const " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "&) = delete;\n"
      "};\n"
      "}\n"
      ))
#+end_src

** Auto-Insert
#+begin_src emacs-lisp
  (use-package auto-insert
    :straight (:type built-in)
    :after (skeleton)
    :hook (find-file-hook . auto-insert)
    :config (define-auto-insert "\\.h\\'" 'header-skeleton))
#+end_src
** OpenSCAD
#+begin_src emacs-lisp
  (use-package scad-mode
    :if home)
  (use-package scad-dbus
    :straight (:type git :flavor melpa :files ("scad-dbus.el") :host github :repo "Lenbok/scad-dbus" :depends "hydra")
    :if home)
#+end_src
* Martin's specials
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/ma-funcs")
  (require 'ma-funcs)
  ;; (require 'ma-simpack-js-mode)
  ;; (add-hook 'js2-mode-hook 'ma-simpack-js-mode)
#+end_src
** Bitbucket interface
#+begin_src emacs-lisp
  (use-package atl-stash
    :straight (:type built-in)
    :if work
    :commands (stash-update-stash-info
               stash-create-branch
               stash-show-pull-requests)
    :config (add-to-list 'mode-line-misc-info '(" " stash-mode-line-string " ") t)
    :bind ("C-c p" . stash-show-pull-requests))
  (when work
    (run-with-idle-timer 30 t 'stash-update-stash-info))
#+end_src
** Kill old buffers
#+begin_src emacs-lisp
  (run-with-idle-timer 1800 t 'ma-kill-old-buffers)
#+end_src
** Marginalia for Jira
#+begin_src emacs-lisp
  (use-package marginalia-jira
    :straight (:type built-in)
    :defer 10
    :if work)
#+end_src
* System
** VTerm
#+begin_src emacs-lisp
  (use-package vterm
    :if work
    :bind (:map vterm-mode-map
                ("C-g" . vterm--self-insert)
                ("<f4>" . ma-switch-to-mu4e)
                ("<f3>" . ma-ssh-connect-with-tmux-support))
    :custom (vterm-copy-exclude-prompt  t)
    :config
    (add-to-list 'display-buffer-alist
                 `("^\\*vterm\\*$"
                   (display-buffer-reuse-window))))

  (defun ma-switch-to-local-vterm ()
    "Create a vterm with a local terminal"
    (interactive)
    (let* ((default-directory "~")
           (buffer-name "*vterm-local*")
           (buffer (get-buffer buffer-name)))
      (pop-to-buffer (or buffer (vterm buffer-name)))
      (when work-linux-local
        (with-current-buffer (vterm buffer-name)
          (vterm-insert "tmux new-session -A\n")))))

  (if work-linux-remote
      (progn
        (defun ma-switch-to-remote-vterm ()
          "Create a vterm with a remote terminal"
          (interactive)
          (let* ((buffer-name "*vterm-remote*")
                 (buffer (get-buffer buffer-name)))
            (if buffer
                (pop-to-buffer buffer)
              (with-current-buffer (vterm buffer-name)
                (vterm-insert "remote\n")
                (vterm-insert "tmux attach\n")
                (pop-to-buffer buffer)))))

        (global-set-key (kbd "<f5>") 'ma-switch-to-remote-vterm)
        (global-set-key (kbd "<f6>") 'ma-switch-to-local-vterm))
    (progn
      (global-set-key (kbd "<f5>") 'ma-switch-to-local-vterm)
      (global-set-key (kbd "<f6>") 'ma-switch-to-local-vterm)))

#+end_src
