init.el

(defun ma-indent-style()
  "Override the built-in BSD indentation style with some additional rules"
  `(;; Here are your custom rules
;;     ((node-is ")") parent-bol 0)
;;     ((match nil "argument_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
;;     ((parent-is "argument_list") prev-sibling 0)
;;     ((match nil "parameter_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
;;     ((parent-is "parameter_list") prev-sibling 0)
    ((and (parent-is "if_statement") (not (node-is "compound_statement"))) parent-bol 3)

    ;; Append here the indent style you want as base
    ,@(alist-get 'bsd (c-ts-mode--indent-styles 'cpp))))

(use-package c-ts-mode
  :if (treesit-language-available-p 'c)
  :disabled t
  :custom
  (c-ts-mode-indent-offset 3)
  (c-ts-mode-indent-style #'ma-indent-style)
  :init
  ;; Remap the standard C/C++ modes
  (add-to-list 'major-mode-remap-alist '(c-mode . c-ts-mode))
  (add-to-list 'major-mode-remap-alist '(c++-mode . c++-ts-mode))
  (add-to-list 'major-mode-remap-alist '(c-or-c++-mode . c-or-c++-ts-mode)))

(add-hook 'c-mode-common-hook
          (lambda ()
            (imenu-add-to-menubar "Functions")
            (local-set-key (kbd "C-c C-i") 'imenu)
            (if work
                (add-hook 'before-save-hook 'ma-create-or-update-copyright))
            (c-toggle-hungry-state 1)
            (cwarn-mode)
            (hs-minor-mode)
            (hs-hide-initial-comment-block)))
(add-to-list 'auto-mode-alist '("\\.h" . c++-mode))

(use-package cmake-mode
  :custom (cmake-tab-width 3)
  :init
  (add-hook 'cmake-mode-hook
            (lambda ()
              (local-set-key (kbd "C-c C-d") 'cmake-help)
              (flyspell-prog-mode)
              (setq indent-line-function 'indent-relative))))

(use-package dockerfile-mode)

(use-package docker-compose-mode)

(use-package js2-mode
:mode ("\\.js$" "\\.sjs$" "\\.qs$")
:custom
(js2-include-node-externs t)
(js2-mode-assume-strict t)
(js2-include-browser-externs nil))

(use-package jenkinsfile-mode)

(use-package auto-compile
  :custom (load-prefer-newer t)
  :config (auto-compile-on-load-mode 1)
  (auto-compile-on-save-mode 1))

(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (local-set-key (kbd "M-.") 'find-function-other-window)))

(add-hook 'sh-set-shell-hook
          (lambda()
            (when (string-equal sh-shell "tcsh")
              (progn
                (require 'csh-mode)
                (setq-local indent-line-function 'csh-indent-line)
                (setq-local indent-region-function 'csh-indent-region)))))
(add-hook 'shell-mode-hook
          'dirtrack-mode)
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)

(use-package restclient)

(use-package generic
  :straight (:type built-in)
  :if work
  :config
  (define-generic-mode
      'spck-mode
    '("!")
    '("body"
      "constr"
      "control"
      "ens"
      "express"
      "force"
      "joint"
      "marker"
      "poly"
      "prim"
      "road"
      "refsys"
      "sensor"
      "slv"
      "substr"
      "subvar"
      "track"
      "timex"
      "view"
      "yout")
    '(
      ("\\(\\$[A-Za-z0-9_]+\\)" 1 font-lock-variable-name-face)
      ("\\([+-]?[0-9]\\.[0-9]+E[+-][0-9]+\\)" 1 font-lock-constant-face)
      ("'\\([^']+\\)'" 1 font-lock-string-face)
      )
    '("\\.sys$" "\\.ani$" "\\.spck$")
    (list
     (function
      (lambda ()
        (setq imenu-generic-expression
              '((nil "(.*\\(\\$[A-Za-z0-9_]+\\).*) *=" 1)))
        (imenu-add-menubar-index)
        (local-set-key [?\C-c ?\C-j] 'imenu))))
    "A mode for SIMPACK model files"))

(use-package skeleton
  :straight (:type built-in)
  :if work
  :config
  (define-skeleton header-skeleton
    "Define a C++ header file skeleton"
    ""
    "// Copyright Dassault Systemes Simulia Corp.\n\n"
    "#pragma once\n\n"
    "#include \"base/WinExportDefs.h\"\n\n"
    "namespace " (skeleton-read "Namespace name?") "\n"
    "{\n\n"
    "class SPCK_XXX_EXPORT " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "\n"
    "{\n"
    "public:\n\n"
    "   " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "(const " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "&) = delete;\n"
    "   " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "& operator=(const " (file-name-sans-extension (file-name-nondirectory buffer-file-name)) "&) = delete;\n"
    "};\n"
    "}\n"
    ))

(use-package auto-insert
  :straight (:type built-in)
  :after (skeleton)
  :hook (find-file-hook . auto-insert)
  :config (define-auto-insert "\\.h\\'" 'header-skeleton))

(use-package scad-mode
  :if home)
(use-package scad-dbus
  :straight (:type git :flavor melpa :files ("scad-dbus.el") :host github :repo "Lenbok/scad-dbus" :depends "hydra")
  :if home)

(add-to-list 'load-path "~/.emacs.d/ma-funcs")
(require 'ma-funcs)
(require 'ma-simpack-js-mode)
(add-hook 'js2-mode-hook 'ma-simpack-js-mode)

(use-package atl-stash
  :straight (:type built-in)
  :if work
  :commands (stash-update-stash-info
             stash-create-branch
             stash-show-pull-requests)
  :config (add-to-list 'mode-line-misc-info '(" " stash-mode-line-string " ") t)
  :bind ("C-c p" . stash-show-pull-requests))
(when work
  (run-with-idle-timer 60 60 'stash-update-stash-info))

(run-with-idle-timer 1800 t 'ma-kill-old-buffers)

(use-package marginalia-jira
  :straight (:type built-in)
  :defer 10
  :if work)

(use-package vterm
  :if work
  :bind (:map vterm-mode-map
  ("C-g" . vterm--self-insert)
  ("<f4>" . ma-switch-to-mu4e)
  ("<f3>" . ma-ssh-connect-with-tmux-support))
  :custom (vterm-copy-exclude-prompt  t)
  :config
  (add-to-list 'display-buffer-alist
               `("^\\*vterm\\*$"
                 (display-buffer-reuse-window))))
(use-package vterm-toggle
  :if work
  :after vterm
  :bind (:map vterm-mode-map ("<f5>" . vterm-toggle))
  :init
  (global-set-key (kbd "<f5>") 'vterm-toggle)
  (global-set-key (kbd "C-<f5>") 'vterm-toggle-cd))
